export const about = [
  {
    title: "個人として",
    paragraphs: [
      `
      自分自身に正直であることを大事にしています。
      自分の感情を素直に受け止め、よく興味を持ち、よく考え、よく勉強する。
      `,
      `
      自分の幸せを考え、周りの幸せも考える。
      自分は一人の個人であると同時に環境の一部でもある。
      `,
      `
      完璧に生きることはできないので、仕組みを作る。
      `,
    ],
  },
  {
    title: "プログラマーとして",
    paragraphs: [
      `
      仙台高等専門学校 情報工学科 を卒業後、プログラマーとして 10 年ほどの経験があります。
      主にサーバーサイドの開発を行っており、パフォーマンスが要求されるソーシャルゲームの開発経験もあります。
      フロントエンドの経験や、テストの効率化、自動化、負荷テストの経験もあります。
      `,
      `
      テストが重要だと考えており、TDD や Property-Based Testing、副作用の側面から関数型言語について勉強をしています。
      `,
      `
      技術を自ら学び続けており、日々向上しています。
      `,
    ],
  },
  {
    title: "やりたいこと",
    paragraphs: [
      `
      自分がつらくない範囲で、プログラミングの力でよりよい社会に貢献したいと思っています。
      `,
      `
      私は、幸せとは状態であり人には幸せを感じる能力があると考えています。
      強制的に幸せにすることはできず、どのような状態を幸せと感じやすいかは人によって異なると思っています。
      `,
      `
      テクノロジーの力はより多くの人が幸せを感じやすい環境を作るのに役立つと思い、自分になにかできることはないかと探しています。
      `,
    ],
  },
]
